swept_wing/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



verbose no;

scale 10;

vertices (

    (-1 -1 0 ) // 0
    ( 1 -1 0 ) // 1
    ( 1 1 0 ) // 2
    (-1 1 0 ) // 3
    (-1 -1 2 ) // 4
    ( 1 -1 2 ) // 5
    ( 1 1 2 ) // 6
    (-1 1 2 ) // 7

);

blocks (

  hex ( 0 1 2 3 4 5 6 7 )
  ( 10 10 10 )
  simpleGrading ( 1 1 1 )

);

edges (
);

boundary (

  topAndBottom {
    type patch;
    faces (
      ( 2 3 6 7 )
      ( 0 1 4 5 )
    );
  }

  inlet {
    type patch;
    faces (
      ( 0 3 4 7 )
    );
  }

  outlet {
    type patch;
    faces (
      ( 1 2 5 6 )
    );
  }

  symFront {
    type patch;
    faces (
      ( 4 5 6 7 )
    );
  }

  symBack {
    type symmetryPlane;
    faces (
      ( 0 1 2 3 )
    );
  }

);

mergePatchPairs (

);
// ************************************************************************* //
