swept_wing/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    topAndBottom
    {
        type            patch;
        nFaces          200;
        startFace       2700;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       2900;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       3000;
    }
    symFront
    {
        type            patch;
        nFaces          100;
        startFace       3100;
    }
    symBack
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          100;
        startFace       3200;
    }
)

// ************************************************************************* //
